sCO2Channel-DES_LibTest/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.X                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


expressions
(
	CreatePressureGradient
	{
		field p;
        globalScopes ( "globalVars" );
		expression "P_inlet+(P_outlet-P_inlet)*(pos().z/L)";
		condition "pos().z<=L";
		keepPatches 1;
	}

);


// *********************************************************************** //
